; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob79) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 pallet13 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate6)
	(at pallet1 depot1)
	(clear crate2)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear crate9)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear crate0)
	(at pallet6 distributor2)
	(clear pallet6)
	(at pallet7 distributor2)
	(clear pallet7)
	(at pallet8 distributor1)
	(clear crate1)
	(at pallet9 depot1)
	(clear crate8)
	(at pallet10 distributor2)
	(clear crate4)
	(at pallet11 depot0)
	(clear pallet11)
	(at pallet12 distributor1)
	(clear crate7)
	(at pallet13 depot1)
	(clear crate3)
	(at truck0 depot2)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 444)
	(at truck1 distributor2)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 287)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot1)
	(available hoist6)
	(at hoist7 distributor2)
	(available hoist7)
	(at hoist8 depot0)
	(available hoist8)
	(at crate0 distributor2)
	(on crate0 pallet5)
	(= (weight crate0) 23)
	(at crate1 distributor1)
	(on crate1 pallet8)
	(= (weight crate1) 23)
	(at crate2 depot1)
	(on crate2 pallet1)
	(= (weight crate2) 84)
	(at crate3 depot1)
	(on crate3 pallet13)
	(= (weight crate3) 68)
	(at crate4 distributor2)
	(on crate4 pallet10)
	(= (weight crate4) 64)
	(at crate5 distributor1)
	(on crate5 pallet12)
	(= (weight crate5) 10)
	(at crate6 depot0)
	(on crate6 pallet0)
	(= (weight crate6) 88)
	(at crate7 distributor1)
	(on crate7 crate5)
	(= (weight crate7) 21)
	(at crate8 depot1)
	(on crate8 pallet9)
	(= (weight crate8) 63)
	(at crate9 distributor0)
	(on crate9 pallet3)
	(= (weight crate9) 47)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate1)
		(on crate1 pallet4)
		(on crate2 pallet10)
		(on crate3 pallet7)
		(on crate4 pallet0)
		(on crate5 crate9)
		(on crate6 crate5)
		(on crate8 pallet8)
		(on crate9 pallet12)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist1 crate2 pallet1 depot1)
   deleted: (at crate2 depot1) (clear crate2) (available hoist1) (on crate2 pallet1)
   added: (lifting hoist1 crate2) (clear pallet1)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 9
2. (drive truck0 depot2 depot1)
   deleted: (at truck0 depot2)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 1 to 11
   goals met: 0 of 9
3. (lift hoist6 crate3 pallet13 depot1)
   deleted: (at crate3 depot1) (clear crate3) (available hoist6) (on crate3 pallet13)
   added: (lifting hoist6 crate3) (clear pallet13)
   changed: (fuel-cost) from 11 to 12
   goals met: 0 of 9
4. (load hoist1 crate2 truck0 depot1)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 84
   goals met: 0 of 9
5. (lift hoist1 crate8 pallet9 depot1)
   deleted: (at crate8 depot1) (clear crate8) (available hoist1) (on crate8 pallet9)
   added: (lifting hoist1 crate8) (clear pallet9)
   changed: (fuel-cost) from 12 to 13
   goals met: 0 of 9
6. (load hoist6 crate3 truck0 depot1)
   deleted: (lifting hoist6 crate3)
   added: (in crate3 truck0) (available hoist6)
   changed: (current_load truck0) from 84 to 152
   goals met: 0 of 9
7. (load hoist1 crate8 truck0 depot1)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck0) (available hoist1)
   changed: (current_load truck0) from 152 to 215
   goals met: 0 of 9
8. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 13 to 23
   goals met: 0 of 9
9. (lift hoist3 crate9 pallet3 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist3) (on crate9 pallet3)
   added: (lifting hoist3 crate9) (clear pallet3)
   changed: (fuel-cost) from 23 to 24
   goals met: 0 of 9
10. (lift hoist8 crate6 pallet0 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist8) (on crate6 pallet0)
   added: (lifting hoist8 crate6) (clear pallet0)
   changed: (fuel-cost) from 24 to 25
   goals met: 0 of 9
11. (lift hoist5 crate0 pallet5 distributor2)
   deleted: (at crate0 distributor2) (clear crate0) (available hoist5) (on crate0 pallet5)
   added: (lifting hoist5 crate0) (clear pallet5)
   changed: (fuel-cost) from 25 to 26
   goals met: 0 of 9
12. (load hoist5 crate0 truck1 distributor2)
   deleted: (lifting hoist5 crate0)
   added: (in crate0 truck1) (available hoist5)
   changed: (current_load truck1) from 0 to 23
   goals met: 0 of 9
13. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 26 to 36
   goals met: 0 of 9
14. (lift hoist7 crate4 pallet10 distributor2)
   deleted: (at crate4 distributor2) (clear crate4) (available hoist7) (on crate4 pallet10)
   added: (lifting hoist7 crate4) (clear pallet10)
   changed: (fuel-cost) from 36 to 37
   goals met: 0 of 9
15. (drive truck0 distributor0 distributor2)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 37 to 47
   goals met: 0 of 9
16. (unload hoist4 crate0 truck1 distributor1)
   deleted: (in crate0 truck1) (available hoist4)
   added: (lifting hoist4 crate0)
   changed: (current_load truck1) from 23 to 0
   goals met: 0 of 9
17. (load hoist7 crate4 truck0 distributor2)
   deleted: (lifting hoist7 crate4)
   added: (in crate4 truck0) (available hoist7)
   changed: (current_load truck0) from 215 to 279
   goals met: 0 of 9
18. (unload hoist5 crate2 truck0 distributor2)
   deleted: (in crate2 truck0) (available hoist5)
   added: (lifting hoist5 crate2)
   changed: (current_load truck0) from 279 to 195
   goals met: 0 of 9
19. (unload hoist7 crate3 truck0 distributor2)
   deleted: (in crate3 truck0) (available hoist7)
   added: (lifting hoist7 crate3)
   changed: (current_load truck0) from 195 to 127
   goals met: 0 of 9
20. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 47 to 57
   goals met: 0 of 9
21. (load hoist8 crate6 truck0 depot0)
   deleted: (lifting hoist8 crate6)
   added: (in crate6 truck0) (available hoist8)
   changed: (current_load truck0) from 127 to 215
   goals met: 0 of 9
22. (unload hoist0 crate4 truck0 depot0)
   deleted: (in crate4 truck0) (available hoist0)
   added: (lifting hoist0 crate4)
   changed: (current_load truck0) from 215 to 151
   goals met: 0 of 9
23. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 57 to 67
   goals met: 0 of 9
24. (drop hoist5 crate2 pallet10 distributor2)
   deleted: (lifting hoist5 crate2) (clear pallet10)
   added: (available hoist5) (at crate2 distributor2) (clear crate2) (on crate2 pallet10)
   goals met: 1 of 9
25. (drop hoist7 crate3 pallet7 distributor2)
   deleted: (lifting hoist7 crate3) (clear pallet7)
   added: (available hoist7) (at crate3 distributor2) (clear crate3) (on crate3 pallet7)
   goals met: 2 of 9
26. (drop hoist0 crate4 pallet0 depot0)
   deleted: (lifting hoist0 crate4) (clear pallet0)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 pallet0)
   goals met: 3 of 9
27. (drop hoist4 crate0 crate7 distributor1)
   deleted: (lifting hoist4 crate0) (clear crate7)
   added: (available hoist4) (at crate0 distributor1) (clear crate0) (on crate0 crate7)
   goals met: 3 of 9
28. (lift hoist4 crate1 pallet8 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist4) (on crate1 pallet8)
   added: (lifting hoist4 crate1) (clear pallet8)
   changed: (fuel-cost) from 67 to 68
   goals met: 3 of 9
29. (drop hoist4 crate1 pallet4 distributor1)
   deleted: (lifting hoist4 crate1) (clear pallet4)
   added: (available hoist4) (at crate1 distributor1) (clear crate1) (on crate1 pallet4)
   goals met: 4 of 9
30. (lift hoist4 crate0 crate7 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist4) (on crate0 crate7)
   added: (lifting hoist4 crate0) (clear crate7)
   changed: (fuel-cost) from 68 to 69
   goals met: 4 of 9
31. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 69 to 79
   goals met: 4 of 9
32. (drop hoist4 crate0 crate1 distributor1)
   deleted: (lifting hoist4 crate0) (clear crate1)
   added: (available hoist4) (at crate0 distributor1) (clear crate0) (on crate0 crate1)
   goals met: 5 of 9
33. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 79 to 89
   goals met: 5 of 9
34. (unload hoist4 crate8 truck0 distributor1)
   deleted: (in crate8 truck0) (available hoist4)
   added: (lifting hoist4 crate8)
   changed: (current_load truck0) from 151 to 88
   goals met: 5 of 9
35. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 89 to 99
   goals met: 5 of 9
36. (drop hoist4 crate8 pallet8 distributor1)
   deleted: (lifting hoist4 crate8) (clear pallet8)
   added: (available hoist4) (at crate8 distributor1) (clear crate8) (on crate8 pallet8)
   goals met: 6 of 9
37. (load hoist3 crate9 truck0 distributor0)
   deleted: (lifting hoist3 crate9)
   added: (in crate9 truck0) (available hoist3)
   changed: (current_load truck0) from 88 to 135
   goals met: 6 of 9
38. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 99 to 109
   goals met: 6 of 9
39. (lift hoist4 crate7 crate5 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist4) (on crate7 crate5)
   added: (lifting hoist4 crate7) (clear crate5)
   changed: (fuel-cost) from 109 to 110
   goals met: 6 of 9
40. (drop hoist4 crate7 crate8 distributor1)
   deleted: (lifting hoist4 crate7) (clear crate8)
   added: (available hoist4) (at crate7 distributor1) (clear crate7) (on crate7 crate8)
   goals met: 6 of 9
41. (unload hoist4 crate6 truck0 distributor1)
   deleted: (in crate6 truck0) (available hoist4)
   added: (lifting hoist4 crate6)
   changed: (current_load truck0) from 135 to 47
   goals met: 6 of 9
42. (load hoist4 crate6 truck1 distributor1)
   deleted: (lifting hoist4 crate6)
   added: (in crate6 truck1) (available hoist4)
   changed: (current_load truck1) from 0 to 88
   goals met: 6 of 9
43. (lift hoist4 crate5 pallet12 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist4) (on crate5 pallet12)
   added: (lifting hoist4 crate5) (clear pallet12)
   changed: (fuel-cost) from 110 to 111
   goals met: 6 of 9
44. (load hoist4 crate5 truck1 distributor1)
   deleted: (lifting hoist4 crate5)
   added: (in crate5 truck1) (available hoist4)
   changed: (current_load truck1) from 88 to 98
   goals met: 6 of 9
45. (unload hoist4 crate9 truck0 distributor1)
   deleted: (in crate9 truck0) (available hoist4)
   added: (lifting hoist4 crate9)
   changed: (current_load truck0) from 47 to 0
   goals met: 6 of 9
46. (drop hoist4 crate9 pallet12 distributor1)
   deleted: (lifting hoist4 crate9) (clear pallet12)
   added: (available hoist4) (at crate9 distributor1) (clear crate9) (on crate9 pallet12)
   goals met: 7 of 9
47. (unload hoist4 crate5 truck1 distributor1)
   deleted: (in crate5 truck1) (available hoist4)
   added: (lifting hoist4 crate5)
   changed: (current_load truck1) from 98 to 88
   goals met: 7 of 9
48. (drop hoist4 crate5 crate9 distributor1)
   deleted: (lifting hoist4 crate5) (clear crate9)
   added: (available hoist4) (at crate5 distributor1) (clear crate5) (on crate5 crate9)
   goals met: 8 of 9
49. (unload hoist4 crate6 truck1 distributor1)
   deleted: (in crate6 truck1) (available hoist4)
   added: (lifting hoist4 crate6)
   changed: (current_load truck1) from 88 to 0
   goals met: 8 of 9
50. (drop hoist4 crate6 crate5 distributor1)
   deleted: (lifting hoist4 crate6) (clear crate5)
   added: (available hoist4) (at crate6 distributor1) (clear crate6) (on crate6 crate5)
   goals met: 9 of 9
